In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)
dates
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.267941 -0.397136  2.027161 -0.097028
2013-01-02 -0.405800 -1.230227 -0.345038  0.070927
2013-01-03 -2.333524  0.172183  1.714129  0.160868
2013-01-04 -0.308881  0.995410 -1.146962  0.501806
2013-01-05 -0.573518  1.925507 -0.064750  0.369543
2013-01-06  0.224461 -0.257342 -0.214508  1.564974

In [5]:
df2 = pd.DataFrame({"A": 1.0,
                    "B": pd.Timestamp("20230102"),
                    "C": pd.Series(1, index=list(range(4)), dtype="float32"),
                    "D": np.array([3] * 4, dtype="int32"),
                    "E": pd.Categorical(["test", "train", "test", "train"]),
                    "F": "foo",
                   }
                  )
df2

     A          B    C  D      E    F
0  1.0 2023-01-02  1.0  3   test  foo
1  1.0 2023-01-02  1.0  3  train  foo
2  1.0 2023-01-02  1.0  3   test  foo
3  1.0 2023-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -0.267941 -0.397136  2.027161 -0.097028
2013-01-02 -0.405800 -1.230227 -0.345038  0.070927
2013-01-03 -2.333524  0.172183  1.714129  0.160868
2013-01-04 -0.308881  0.995410 -1.146962  0.501806
2013-01-05 -0.573518  1.925507 -0.064750  0.369543

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.308881  0.995410 -1.146962  0.501806
2013-01-05 -0.573518  1.925507 -0.064750  0.369543
2013-01-06  0.224461 -0.257342 -0.214508  1.564974

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.to_numpy()

array([[-0.26794086, -0.39713562,  2.02716127, -0.09702837],
       [-0.40579962, -1.23022702, -0.34503771,  0.07092682],
       [-2.33352408,  0.17218297,  1.7141286 ,  0.1608678 ],
       [-0.30888089,  0.99540964, -1.14696231,  0.50180635],
       [-0.57351767,  1.92550728, -0.06475042,  0.36954278],
       [ 0.22446082, -0.25734205, -0.21450825,  1.56497403]])

In [13]:
df2.dtypes
df2.to_numpy()

array([[1.0, Timestamp('2023-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2023-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2023-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2023-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.610867  0.201399  0.328339  0.428515
std    0.885162  1.115535  1.255831  0.596001
min   -2.333524 -1.230227 -1.146962 -0.097028
25%   -0.531588 -0.362187 -0.312405  0.093412
50%   -0.357340 -0.042580 -0.139629  0.265205
75%   -0.278176  0.789603  1.269409  0.468740
max    0.224461  1.925507  2.027161  1.564974

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.267941   -0.405800   -2.333524   -0.308881   -0.573518    0.224461
B   -0.397136   -1.230227    0.172183    0.995410    1.925507   -0.257342
C    2.027161   -0.345038    1.714129   -1.146962   -0.064750   -0.214508
D   -0.097028    0.070927    0.160868    0.501806    0.369543    1.564974

In [16]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.097028  2.027161 -0.397136 -0.267941
2013-01-02  0.070927 -0.345038 -1.230227 -0.405800
2013-01-03  0.160868  1.714129  0.172183 -2.333524
2013-01-04  0.501806 -1.146962  0.995410 -0.308881
2013-01-05  0.369543 -0.064750  1.925507 -0.573518
2013-01-06  1.564974 -0.214508 -0.257342  0.224461

In [17]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-02 -0.405800 -1.230227 -0.345038  0.070927
2013-01-01 -0.267941 -0.397136  2.027161 -0.097028
2013-01-06  0.224461 -0.257342 -0.214508  1.564974
2013-01-03 -2.333524  0.172183  1.714129  0.160868
2013-01-04 -0.308881  0.995410 -1.146962  0.501806
2013-01-05 -0.573518  1.925507 -0.064750  0.369543

In [18]:
df["A"]

2013-01-01   -0.267941
2013-01-02   -0.405800
2013-01-03   -2.333524
2013-01-04   -0.308881
2013-01-05   -0.573518
2013-01-06    0.224461
Freq: D, Name: A, dtype: float64

In [19]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.267941 -0.397136  2.027161 -0.097028
2013-01-02 -0.405800 -1.230227 -0.345038  0.070927
2013-01-03 -2.333524  0.172183  1.714129  0.160868

In [20]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.405800 -1.230227 -0.345038  0.070927
2013-01-03 -2.333524  0.172183  1.714129  0.160868
2013-01-04 -0.308881  0.995410 -1.146962  0.501806

In [21]:
df.loc[dates[0]]

A   -0.267941
B   -0.397136
C    2.027161
D   -0.097028
Name: 2013-01-01 00:00:00, dtype: float64

In [22]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -0.267941 -0.397136
2013-01-02 -0.405800 -1.230227
2013-01-03 -2.333524  0.172183
2013-01-04 -0.308881  0.995410
2013-01-05 -0.573518  1.925507
2013-01-06  0.224461 -0.257342

In [23]:
df.loc["20130102":"20130104", ["A","B"]]

                   A         B
2013-01-02 -0.405800 -1.230227
2013-01-03 -2.333524  0.172183
2013-01-04 -0.308881  0.995410

In [24]:
df.loc[dates[0], "A"]

np.float64(-0.2679408551041982)

In [25]:
df.at[dates[0],"A"]

np.float64(-0.2679408551041982)

In [26]:
df.iloc[3]

A   -0.308881
B    0.995410
C   -1.146962
D    0.501806
Name: 2013-01-04 00:00:00, dtype: float64

In [27]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.308881  0.995410
2013-01-05 -0.573518  1.925507

In [29]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02 -0.405800 -0.345038
2013-01-03 -2.333524  1.714129
2013-01-05 -0.573518 -0.064750

In [30]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.405800 -1.230227 -0.345038  0.070927
2013-01-03 -2.333524  0.172183  1.714129  0.160868

In [31]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.397136  2.027161
2013-01-02 -1.230227 -0.345038
2013-01-03  0.172183  1.714129
2013-01-04  0.995410 -1.146962
2013-01-05  1.925507 -0.064750
2013-01-06 -0.257342 -0.214508

In [36]:
df.iloc[1, 1]
df.iat[1,1]

np.float64(-1.2302270214249735)

In [37]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-06  0.224461 -0.257342 -0.214508  1.564974

In [38]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN  2.027161       NaN
2013-01-02       NaN       NaN       NaN  0.070927
2013-01-03       NaN  0.172183  1.714129  0.160868
2013-01-04       NaN  0.995410       NaN  0.501806
2013-01-05       NaN  1.925507       NaN  0.369543
2013-01-06  0.224461       NaN       NaN  1.564974

In [41]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01 -0.267941 -0.397136  2.027161 -0.097028    one
2013-01-02 -0.405800 -1.230227 -0.345038  0.070927    one
2013-01-03 -2.333524  0.172183  1.714129  0.160868    two
2013-01-04 -0.308881  0.995410 -1.146962  0.501806  three
2013-01-05 -0.573518  1.925507 -0.064750  0.369543   four
2013-01-06  0.224461 -0.257342 -0.214508  1.564974  three

In [42]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -2.333524  0.172183  1.714129  0.160868   two
2013-01-05 -0.573518  1.925507 -0.064750  0.369543  four

In [49]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102",periods=6))
s1
df["F"] = s1
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [46]:
df.at[dates[0], "A"] = 0
df.iat[0, 1] = 0
df.loc[:, "D"] = np.array([5] * len(df))
df

                   A         B         C    D
2013-01-01  0.000000  0.000000  2.027161  5.0
2013-01-02 -0.405800 -1.230227 -0.345038  5.0
2013-01-03 -2.333524  0.172183  1.714129  5.0
2013-01-04 -0.308881  0.995410 -1.146962  5.0
2013-01-05 -0.573518  1.925507 -0.064750  5.0
2013-01-06  0.224461 -0.257342 -0.214508  5.0

In [50]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -2.027161 -5.0  NaN
2013-01-02 -0.405800 -1.230227 -0.345038 -5.0 -1.0
2013-01-03 -2.333524 -0.172183 -1.714129 -5.0 -2.0
2013-01-04 -0.308881 -0.995410 -1.146962 -5.0 -3.0
2013-01-05 -0.573518 -1.925507 -0.064750 -5.0 -4.0
2013-01-06 -0.224461 -0.257342 -0.214508 -5.0 -5.0

In [53]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  2.027161  5.0  NaN  1.0
2013-01-02 -0.405800 -1.230227 -0.345038  5.0  1.0  1.0
2013-01-03 -2.333524  0.172183  1.714129  5.0  2.0  NaN
2013-01-04 -0.308881  0.995410 -1.146962  5.0  3.0  NaN

In [54]:
df1.dropna(how="any")

                 A         B         C    D    F    E
2013-01-02 -0.4058 -1.230227 -0.345038  5.0  1.0  1.0

In [55]:
df1.fillna(value=5)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  2.027161  5.0  5.0  1.0
2013-01-02 -0.405800 -1.230227 -0.345038  5.0  1.0  1.0
2013-01-03 -2.333524  0.172183  1.714129  5.0  2.0  5.0
2013-01-04 -0.308881  0.995410 -1.146962  5.0  3.0  5.0

In [56]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [57]:
df.mean()

A   -0.566210
B    0.267588
C    0.328339
D    5.000000
F    3.000000
dtype: float64

In [58]:
df.mean(axis=1)

2013-01-01    1.756790
2013-01-02    0.803787
2013-01-03    1.310557
2013-01-04    1.507913
2013-01-05    2.057448
2013-01-06    1.950522
Freq: D, dtype: float64

In [61]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [62]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -3.333524 -0.827817  0.714129  4.0  1.0
2013-01-04 -3.308881 -2.004590 -4.146962  2.0  0.0
2013-01-05 -5.573518 -3.074493 -5.064750  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [63]:
df.agg(lambda x: np.mean(x) *5.6)

A    -3.170777
B     1.498495
C     1.838696
D    28.000000
F    16.800000
dtype: float64

In [64]:
df.transform(lambda x:x * 101.2)

                     A           B           C      D      F
2013-01-01    0.000000    0.000000  205.148720  506.0    NaN
2013-01-02  -41.066921 -124.498975  -34.917816  506.0  101.2
2013-01-03 -236.152637   17.424917  173.469814  506.0  202.4
2013-01-04  -31.258746  100.735456 -116.072586  506.0  303.6
2013-01-05  -58.039988  194.861337   -6.552743  506.0  404.8
2013-01-06   22.715435  -26.043015  -21.708235  506.0  506.0

In [66]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    6
1    5
2    2
3    3
4    3
5    3
6    2
7    4
8    0
9    2
dtype: int64

In [67]:
s.value_counts()

3    3
2    3
5    1
6    1
4    1
0    1
Name: count, dtype: int64

In [69]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [70]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -0.133254 -0.771769  1.730437  1.182085
1 -0.824322  0.473075  0.480733  0.028085
2 -0.654566 -1.009484  0.848921  0.647262
3 -1.689083 -0.270965  0.398147 -2.439668
4 -1.197569 -0.951657  1.925806  1.020577
5  0.075852 -2.671200 -1.250772  1.561194
6  0.899708  0.910093  0.282249  0.595454
7  1.253365  0.189859  1.544476 -0.034221
8  1.025344 -0.279816  1.077411  0.096050
9 -0.118467  0.470072 -0.481071  1.013239

In [72]:
pieces = [df[:3],df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0 -0.133254 -0.771769  1.730437  1.182085
1 -0.824322  0.473075  0.480733  0.028085
2 -0.654566 -1.009484  0.848921  0.647262
3 -1.689083 -0.270965  0.398147 -2.439668
4 -1.197569 -0.951657  1.925806  1.020577
5  0.075852 -2.671200 -1.250772  1.561194
6  0.899708  0.910093  0.282249  0.595454
7  1.253365  0.189859  1.544476 -0.034221
8  1.025344 -0.279816  1.077411  0.096050
9 -0.118467  0.470072 -0.481071  1.013239

In [82]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1,2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4,5]})
left, right

(   key  lval
 0  foo     1
 1  foo     2,
    key  rval
 0  foo     4
 1  foo     5)

pd.merge(left, right, on="key")

In [84]:
df = pd.DataFrame({ "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one  0.533246 -1.221449
1  bar    one -0.167416 -0.200280
2  foo    two  0.612961  0.008418
3  bar  three  1.647372  0.824258
4  foo    two -0.419688 -0.355132
5  bar    two -1.863008 -0.398568
6  foo    one -0.666183  0.102885
7  foo  three -0.197222  1.142325

In [86]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar -0.383052  0.225410
foo -0.136887 -0.322953

In [85]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one   -0.167416 -0.200280
    three  1.647372  0.824258
    two   -1.863008 -0.398568
foo one   -0.132937 -1.118564
    three -0.197222  1.142325
    two    0.193272 -0.346714

In [89]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=(["A", "B"]))
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.101837  1.139497
      two    -1.339079  0.839089
baz   one    -0.072032 -0.544972
      two     0.590733 -0.395780

In [90]:
stacked = df2.stack(future_stack=True)
stacked

first  second
bar    one     A    0.101837
               B    1.139497
       two     A   -1.339079
               B    0.839089
baz    one     A   -0.072032
               B   -0.544972
       two     A    0.590733
               B   -0.395780
dtype: float64

In [92]:
stacked.unstack()

                     A         B
first second
bar   one     0.101837  1.139497
      two    -1.339079  0.839089
baz   one    -0.072032 -0.544972
      two     0.590733 -0.395780

In [93]:
stacked.unstack(1)

second        one       two
first
bar   A  0.101837 -1.339079
      B  1.139497  0.839089
baz   A -0.072032  0.590733
      B -0.544972 -0.395780

In [94]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.101837 -0.072032
       B  1.139497 -0.544972
two    A -1.339079  0.590733
       B  0.839089 -0.395780

In [95]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
df

        A  B    C         D         E
0     one  A  foo  1.916290 -0.513714
1     one  B  foo  0.267296  1.109469
2     two  C  foo  1.295361 -0.203004
3   three  A  bar -0.416942 -0.018957
4     one  B  bar  0.050412  0.729650
5     one  C  bar  0.311462  0.131407
6     two  A  foo  0.163197  1.564321
7   three  B  foo  2.395856  0.130645
8     one  C  foo -1.176811 -0.865114
9     one  A  bar  0.167637 -0.485644
10    two  B  bar  1.719603  0.602229
11  three  C  bar  0.511078 -0.509331

In [96]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A  0.167637  1.916290
      B  0.050412  0.267296
      C  0.311462 -1.176811
three A -0.416942       NaN
      B       NaN  2.395856
      C  0.511078       NaN
two   A       NaN  0.163197
      B  1.719603       NaN
      C       NaN  1.295361

In [100]:
rng = pd.date_range("1/1/2012", periods=100, freq="s")
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.resample("5Min").sum()

2012-01-01    24061
Freq: 5min, dtype: int64

In [104]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    1.811872
2012-03-07    0.467718
2012-03-08    0.895300
2012-03-09   -0.935588
2012-03-10    0.476901
Freq: D, dtype: float64

In [106]:
ts_utc = ts.tz_localize("UTC")
ts_utc

2012-03-06 00:00:00+00:00    1.811872
2012-03-07 00:00:00+00:00    0.467718
2012-03-08 00:00:00+00:00    0.895300
2012-03-09 00:00:00+00:00   -0.935588
2012-03-10 00:00:00+00:00    0.476901
Freq: D, dtype: float64

In [107]:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00    1.811872
2012-03-06 19:00:00-05:00    0.467718
2012-03-07 19:00:00-05:00    0.895300
2012-03-08 19:00:00-05:00   -0.935588
2012-03-09 19:00:00-05:00    0.476901
Freq: D, dtype: float64

In [108]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [109]:
rng + pd.offsets.BusinessDay(5)

DatetimeIndex(['2012-03-13', '2012-03-14', '2012-03-15', '2012-03-16',
               '2012-03-16'],
              dtype='datetime64[ns]', freq=None)

In [110]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)

In [111]:
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [112]:
new_categories = ["very good", "good", "very bad"]
df["grade"] = df["grade"].cat.rename_categories(new_categories)

In [113]:
df["grade"] = df["grade"].cat.set_categories(
    ["very bad", "bad", "medium", "good", "very good"]
)
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [114]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [115]:
df.groupby("grade", observed=False).size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

In [117]:
import matplotlib.pyplot as plt
plt.close("all")

ModuleNotFoundError: No module named 'matplotlib'

In [122]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range("1/1/2000", periods=1000))
ts = ts.cumsum()

In [124]:
df = pd.DataFrame(np.random.randint(0, 5, (10, 5)))
df.to_csv("foo.csv")

In [125]:
df.to_parquet("foo.parquet")

In [126]:
pd.read_parquet("foo.parquet")

   0  1  2  3  4
0  4  2  0  2  2
1  0  2  2  3  1
2  1  0  2  1  1
3  2  0  4  0  1
4  0  0  4  2  1
5  4  1  4  4  2
6  2  0  2  2  2
7  1  2  3  4  4
8  1  0  1  2  4
9  4  2  2  2  0

In [127]:
df.to_excel("foo.xlsx", sheet_name="Sheet1")

ModuleNotFoundError: No module named 'openpyxl'

In [128]:
pd.read_excel("foo.xlsx", "Sheet1", index_col=None, na_values=["NA"])

FileNotFoundError: [Errno 2] No such file or directory: 'foo.xlsx'

In [129]:
if pd.Series([False, True, False]):
     print("I was true")

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().